Documents/Заявка_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заявка_ат</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЗаявок_ат</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>TODO - ren</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тезис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявкиВHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗаявок_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ВнутреннийКомментарийВHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ОжидаемаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Причастные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыУведомлений_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СвязиОбъектов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбъектов_ат</Name>
			<Comment>ВНИМАНИЕ! После объединения необходимо установить тип значений измерения Объекты как ссылки на связываемые объекты метаданных!</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвязиОбъектов_ТипыСвязей_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СсылкаНаКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСтатусовЗаданий_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовЗаданий_ат</Name>
			<Comment>!!!!!HOTFIX</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданий_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусов_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредметыПапкиВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПредметыПапкиВзаимодействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Согласование_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПапкаЭлектронногоПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Согласование_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСтатусовЗаявок_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовЗаявок_ат</Name>
			<Comment>!!!!!HOTFIX</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусов_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявок_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пожелание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВнутреннемСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТестировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииРелиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПриемке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыУведомлений_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееФинансовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПоПродукту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСпециальное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееТехническое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееФинансовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПоПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПоКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСпециальное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееТехническое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявка_ат/Forms/ОтветНаПисьмоПоЗаявке/Ext/Form/Module.bsl
&НаКлиенте
Перем КоординатыЗаменяемогоСлова;

&НаКлиенте
Перем СоответствиеКомандЗаменыСловам;

#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Параметры.Основание;
	
	ЗаполнитьПоОснованию();
	
	РаботаСHTML_Сервер_ат.СоздатьПанелиРаботыСHTML(ЭтаФорма, Элементы.КомманднаяПанельКнопокРедактированияHTML,
		"ОбработчикКомандРаботыСHTML", Истина, Элементы.СодержаниеКонтекстноеМеню);
		
	ОбновитьОтображение();
	
КонецПроцедуры

#КонецОбласти

#Область  HTML

&НаКлиенте
Процедура ОбработчикКомандРаботыСHTML(Команда, ВыбранноеЗначение)
	
	РаботаСHTML_Клиент_ат.ОбработчикКомандРаботыСHTML(ЭтаФорма, Команда, ВыбранноеЗначение,
		Элементы.Содержание, Элементы.КомманднаяПанельКнопокРедактированияHTML,
		КоординатыЗаменяемогоСлова, СоответствиеКомандЗаменыСловам);
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеДокументСформирован(Элемент)
	
	//ДобавитьОбработчик Элемент.Документ.Body.OnContextMenu, ОбработчикСобытийПоляHTML;
	//ДобавитьОбработчик Элемент.Документ.Body.OnPaste, ОбработчикСобытийПоляHTML;
	
	РаботаСHTML_Клиент_ат.ВключитьВозможностьРедактирования(ЭтаФорма,
		Элементы.Содержание, Элементы.КомманднаяПанельКнопокРедактированияHTML, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСобытийПоляHTML(Событие) Экспорт
	
	Если Событие.type = "contextmenu" Тогда
		
		ПолеМожноРедактировать = РаботаСHTML_Клиент_ат.HTMLПолеМожноРедактировать(Элементы.Содержание);
		
		Для Каждого ЭлементКонтекстногоМеню Из Элементы.Содержание.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			
			Если НЕ ЭлементКонтекстногоМеню.Имя = "Содержание_КонтекстноеМеню_ВключитьВозможностьРедактирования"
			   И НЕ ЭлементКонтекстногоМеню.Имя = "Содержание_КонтекстноеМеню_ПроверитьОрфографию" Тогда
				ЭлементКонтекстногоМеню.Доступность = ПолеМожноРедактировать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПолеМожноРедактировать Тогда
			
			Если Событие.srcElement.id = "red_marker" Тогда
				
				РаботаСHTML_Клиент_ат.ОбработатьВызовКонтекстногоМеню(Событие, КоординатыЗаменяемогоСлова, СоответствиеКомандЗаменыСловам);	
				
				ИзменитьКонтестноеМенюЗаменыСловПоляHTML(СоответствиеКомандЗаменыСловам);
				
			Иначе
				
				ИзменитьКонтестноеМенюЗаменыСловПоляHTML(Неопределено, Истина);
				
			КонецЕсли;
			
		Иначе
			
			ИзменитьКонтестноеМенюЗаменыСловПоляHTML(Неопределено, Истина);
			
		КонецЕсли;
		
	ИначеЕсли Событие.type = "paste" Тогда
		
		ИдентификаторыКартинок.ЗагрузитьЗначения(РаботаСHTML_Клиент_ат.ПолучитьИдентификаторыКартинок(Элементы.Содержание.Документ));
		ПодключитьОбработчикОжидания("УдалитьКартинкиВставленныеКопированием", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКартинкиВставленныеКопированием() Экспорт
	
	РаботаСHTML_Клиент_ат.УдалитьКартинкиВставленныеКопированием(Элементы.Содержание.Документ,
																	ИдентификаторыКартинок.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКонтестноеМенюЗаменыСловПоляHTML(СоответствиеКомандЗаменыСловам, ТолькоОчистить = Ложь)
	
	РаботаСHTML_Сервер_ат.ИзменитьКонтестноеМенюЗаменыСловПоляHTML(ЭтаФорма,
		Элементы.Содержание.КонтекстноеМеню, СоответствиеКомандЗаменыСловам, ТолькоОчистить, "ОбработчикКомандРаботыСHTML");
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	РаботаСHTML_Клиент_ат.ИзменитьПометкиКнопок(Элементы.КомманднаяПанельКнопокРедактированияHTML, Элементы.Содержание.Документ);	
	
	РаботаСHTML_Клиент_ат.ПерейтиПоСсылке(ДанныеСобытия.href);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеРешениеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область  ОбработчикиКоманд

&НаКлиенте
Процедура Отправить(Команда)
	
	РаботаСHTML_Клиент_ат.ОбработатьHTMLПередЗаписью(Элементы.Содержание);
	Элементы.Содержание.Документ.body.InnerHTML =
		ПроверкаОрфографии_Клиент_ат.УдалитьИзТекстаHTMLТэгиВыделения(Элементы.Содержание.Документ.body.InnerHTML);
	Содержание = Элементы.Содержание.Документ.documentElement.outerHTML;
	
	Если Отправить_НаСервере() Тогда
		
		ПоказатьПредупреждение(, "Письмо отправлено", 5);
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   Отправить_НаСервере()
	
	НачатьТранзакцию();
	
	Попытка
		
		ОтправитьТиповоеПисьмо = ОбычноеПисьмо;
		
		Вложения = Новый ТаблицаЗначений;
		Вложения.Колонки.Добавить("АдресВоВременномХранилище");
		Вложения.Колонки.Добавить("ИмяФайлаСРасширением");
		
		Для Каждого СтрокаФайлов Из Файлы Цикл
			
			Если СтрокаФайлов.Отправлять Тогда
				
				НоваяСтрока = Вложения.Добавить();
				
				Если ЗначениеЗаполнено(СтрокаФайлов.Файл) Тогда
					
					ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(СтрокаФайлов.Файл);
					АдресВоВременномХранилище = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
					
				Иначе
					
					АдресВоВременномХранилище = СтрокаФайлов.АдресВоВременномХранилище;
					
				КонецЕсли;
				
				НоваяСтрока.АдресВоВременномХранилище = АдресВоВременномХранилище;
				ИмяФайла = СтрокаФайлов.ИмяФайла;
				НоваяСтрока.ИмяФайлаСРасширением = ИмяФайла;
				
			КонецЕсли;
			
			Если СтрокаФайлов.ДобавлятьВЗаявку Тогда
				ПрисоединенныеФайлы.ДобавитьФайл(Заявка, ИмяФайла,,,, АдресВоВременномХранилище);
			КонецЕсли;
			
		КонецЦикла;
		
		СтатусЗаявки = Планирование_Сервер_ат.ПолучитьТекущийСтатус(Заявка);
		
		Если НЕ ОтправитьТиповоеПисьмо Тогда
			
			Если СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.НаПриемке Тогда
				
				Уведомления_ат.СоздатьПисьмоДляПриемкиЗаявки(Заявка, Содержание, Вложения);
				ОтправитьТиповоеПисьмо = Ложь;
				
			ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.НаСогласовании Тогда
				
				Согласование = Согласование_ат.ПолучитьПоследнееСогласованиеПоЗаявке(Заявка);
				
				Если Согласование = Неопределено Тогда
					
					ОтправитьТиповоеПисьмо = Истина;
					
				Иначе
					
					Уведомления_ат.СоздатьПисьмоДляСогласованияЗаявки(Согласование, Содержание, Вложения); //????????
					ОтправитьТиповоеПисьмо = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОтправитьТиповоеПисьмо Тогда
			
			ТаблицаПолучателей = ОбработчикиСобытийДляПочтовыхДокументов_ат.ПолучитьТаблицуАдресовДляУведомленийПользователей(Получатель);
			ТаблицаПолучателейКопий = ОбработчикиСобытийДляПочтовыхДокументов_ат.ПолучитьТаблицуАдресовДляУведомленийПользователей(ПолучателиКопий);
			
			Если ТаблицаПолучателей.Количество() = 0 И ТаблицаПолучателейКопий.Количество() = 0 Тогда
				
				Сообщить("Не выбраны получатели письма");
				Возврат Ложь;
				
			КонецЕсли;
			
			Получатели = ТаблицаПолучателей.ВыгрузитьКолонку("Контакт");
			
			Для Каждого ПолучательКопии Из ТаблицаПолучателейКопий.ВыгрузитьКолонку("Контакт")  Цикл
				
				Если Получатели.Найти(ПолучательКопии) = Неопределено Тогда
					Получатели.Добавить(ПолучательКопии);
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(Содержание);
			
			ОписаниеЗаявки = Уведомления_ат.СоздатьДокументHTMLСОписаниемЗаявки(Заявка,, Ложь, Получатели);
			
			ЭлементБлок = ДокументHTML.СоздатьЭлемент("p");
			ДокументHTML.Тело.ДобавитьДочерний(ЭлементБлок);
			
			РаботаСHTML_Сервер_ат.ИмпортироватьДокументВЭлемент(ДокументHTML, ЭлементБлок, ОписаниеЗаявки);
			
			Уведомления_ат.СоздатьПисьмо(ДокументHTML, Основание, Уведомления_ат.ПолучитьТемуПисьмаОСменеСтатуса(Заявка),
				ТаблицаПолучателей, ТаблицаПолучателейКопий, Истина,, ОжидатьОтвета,
				Перечисления.ТипыУведомлений_ат.ВнешнееПоЗаявке, Истина, Вложения);
			
			Если ОжидатьОтвета
				И НЕ СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.Закрыта
				И НЕ СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.Отклонена
				И НЕ СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.Отменена Тогда
				
				Планирование_Сервер_ат.УстановитьСтатус(Заявка, Перечисления.СтатусыЗаявок_ат.ВОжиданииОтвета, ТекущаяДатаСеанса(), Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображение()
	
	СтатусЗаявки = Планирование_Сервер_ат.ПолучитьТекущийСтатус(Заявка);
	ПростойОтвет = (СтатусЗаявки <> Перечисления.СтатусыЗаявок_ат.НаПриемке
		И СтатусЗаявки <> Перечисления.СтатусыЗаявок_ат.НаСогласовании);
	
	Элементы.ПолучателиКопий.Видимость = ПростойОтвет;
	Элементы.ОжидатьОтвета.Видимость = ПростойОтвет;
	Элементы.ОжидатьОтвета.ТолькоПросмотр = НЕ ПростойОтвет;
	
	Если ПростойОтвет Тогда
		
		ОбычноеПисьмо = Истина;
		Элементы.ОбычноеПисьмо.Видимость = Ложь;
		
	ИначеЕсли НЕ ПростойОтвет И СтатусЗаявки = Перечисления.СтатусыЗаявок_ат.НаПриемке Тогда
		
		Элементы.ОбычноеПисьмо.ФорматРедактирования = "БЛ='На приемку'; БИ='Обычное письмо'";
		
	Иначе
		
		Элементы.ОбычноеПисьмо.ФорматРедактирования = "БЛ='На согласование'; БИ='Обычное письмо'";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Заявка_ат") Тогда
		
		Заявка = Основание;
		Задание = ПолучитьПоследнееЗаданиеПоЗаявке(Заявка);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		Заявка = ПолучитьЗаявкуПоПисьму(Основание);
		Задание = ПолучитьПоследнееЗаданиеПоЗаявке(Заявка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда
		
		Пользователь = Заявка.Сотрудник;
		Обработки.ФинализацияЗиЗ_ат.ЗаполнитьФайлы(Файлы, Заявка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция   ПолучитьПоследнееЗаданиеПоЗаявке(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвязиОбъектов_ат.Объект
	|ИЗ
	|	РегистрСведений.СвязиОбъектов_ат КАК СвязиОбъектов_ат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовЗаданий_ат.СрезПоследних КАК ИсторияСтатусовЗаданий_атСрезПоследних
	|		ПО СвязиОбъектов_ат.Объект = ИсторияСтатусовЗаданий_атСрезПоследних.Ссылка
	|ГДЕ
	|	СвязиОбъектов_ат.Предок = &Предок
	|	И СвязиОбъектов_ат.Предок ССЫЛКА Документ.Заявка_ат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияСтатусовЗаданий_атСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("Предок", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Объект;
		
	КонецЕсли;
	
	
КонецФункции

Функция   ПолучитьЗаявкуПоПисьму(Письмо)
	
	ВзаимодействияПоПисьму = Взаимодействия.ПолучитьВзаимодействияИзЦепочки(Письмо, Письмо);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПредметыВзаимодействий.Взаимодействие КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыВзаимодействий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовЗаявок_ат.СрезПоследних КАК ИсторияСтатусовЗаявок_атСрезПоследних
	|		ПО ПредметыВзаимодействий.Взаимодействие = ИсторияСтатусовЗаявок_атСрезПоследних.Ссылка
	|ГДЕ
	|	ПредметыВзаимодействий.Предмет В(&Предметы)
	|	И ПредметыВзаимодействий.Взаимодействие ССЫЛКА Документ.Заявка_ат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияСтатусовЗаявок_атСрезПоследних.Период УБЫВ";
	
	Предметы = Новый Массив;
	Предметы.Добавить(Письмо);
	Предметы.Добавить(Взаимодействия.ПолучитьЗначениеПредмета(Письмо));
	
	Запрос.УстановитьПараметр("Предметы", Предметы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаявкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаявкаПриИзмененииНаСервере()
	
	ОбновитьОтображение();
	Пользователь = Заявка.Сотрудник;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = Элементы.Файлы.ТекущиеДанные.ПутьКФайлу;
	
	Если Диалог.Выбрать() Тогда
		
		ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
		
		Файл = Новый Файл(ПутьКФайлу);
		Элементы.Файлы.ТекущиеДанные.ИмяФайла = Файл.Имя;
		Элементы.Файлы.ТекущиеДанные.ПутьКФайлу = ПутьКФайлу;
		Элементы.Файлы.ТекущиеДанные.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДобавлятьВЗаявкуПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Файлы.ТекущиеДанные.Файл) Тогда
		Элементы.Файлы.ТекущиеДанные.ДобавлятьВЗаявку = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
